movie_list/movie_list_api/app/controllers/movies_controller.rb

INSERT INTO "movies" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-05-10 19:46:44.509983"], ["updated_at", "2020-05-10 19:46:44.509983"]]
---
  def create
    movie = Movie.create(movie_param)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "movies" SET "watched" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["watched", true], ["updated_at", "2020-05-10 19:55:10.006265"], ["id", 6]]
---
  def update
    movie = Movie.find(params[:id])
    movie.update_attributes(movie_param)